app/controllers/companies_controller.rb

INSERT INTO "companies" ("name", "zip_code", "phone", "email", "city", "state") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Another company"], ["zip_code", "30302"], ["phone", ""], ["email", ""], ["city", "Atlanta"], ["state", "GA"]]
SELECT "companies".* FROM "companies" ORDER BY "companies"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
  def create
    @company = Company.new(company_params)
    if @company.save
      redirect_to companies_path, notice: "Saved"
    else
      flash.now[:error] = "#{@company.errors.full_messages.as_json.join(",")}"

DELETE FROM "companies" WHERE "companies"."id" = $1  [["id", 980551047]]
---
  def destroy
    if @company.destroy

UPDATE "companies" SET "zip_code" = $1, "city" = $2, "state" = $3 WHERE "companies"."id" = $4  [["zip_code", "27831"], ["city", "Garysburg"], ["state", "NC"], ["id", 980551048]]
---
  def update
    if @company.update(company_params)